schemas/src/main/resources/ogc/pubsub/1.0/examples/soap/3a-notify-wrapped.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
    The Publisher is notifying the Receiver.  This is used when the Subscriber does not use wsn:UseRaw in the Subscription
-->
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:wsn="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:fes="http://www.opengis.net/fes/2.0"
    xmlns:gml="http://www.opengis.net/gml/3.2"
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/ 
    http://docs.oasis-open.org/wsn/b-2 http://docs.oasis-open.org/wsn/b-2.xsd
    http://www.w3.org/2005/08/addressing http://www.w3.org/2006/03/addressing/ws-addr.xsd
    http://www.opengis.net/fes/2.0 http://schemas.opengis.net/filter/2.0/filterAll.xsd
    http://www.opengis.net/gml/3.2 http://schemas.opengis.net/gml/3.2.1/gml.xsd">

    <s:Header>
        <wsa:Action>http://docs.oasis-open.org/wsn/bw-2/NotificationConsumer/Notify</wsa:Action>
    </s:Header>

    <s:Body>

        <wsn:Notify>
            <wsn:NotificationMessage>
                
                <wsn:SubscriptionReference>
                    <!-- The subscription identifier -->
                    <wsa:Address>http://host.org/pubsub/subscription/aircraftSubscription1</wsa:Address>
                </wsn:SubscriptionReference>
                
                <wsn:ProducerReference>
                    <!-- The Publisher endpoint -->
                    <wsa:Address>http://publisher.org/endpoint</wsa:Address>
                </wsn:ProducerReference>
                
                <wsn:Message>

                    <host:AircraftPosition xmlns:host="http://host.org/schema/aircraft"
                        xmlns:gml="http://www.opengis.net/gml/3.2">
                        <location>
                            <gml:Point gml:id="p21"
                                srsName="http://www.opengis.net/def/crs/EPSG/0/4979">
                                <gml:pos srsDimension="3">60.15 -21.0833 12000</gml:pos>
                            </gml:Point>
                        </location>
                        <time>
                            <gml:TimeInstant gml:id="time-instant">
                                <gml:timePosition>2011-09-13T20:49:00Z</gml:timePosition>
                            </gml:TimeInstant>
                        </time>
                        <aircraftType>A380</aircraftType>
                    </host:AircraftPosition>

                </wsn:Message>
                
            </wsn:NotificationMessage>
            
            <!-- More than one message may be included in a notification -->
            <wsn:NotificationMessage>
                <wsn:Message>
                    
                    <host:AircraftPosition xmlns:host="http://host.org/schema/airacraft">
                      ...    
                    </host:AircraftPosition>
                    
                </wsn:Message>
            </wsn:NotificationMessage>
        </wsn:Notify>

    </s:Body>
</s:Envelope>
